N = 12 # Длиина
L = 1 # Начальное положение лягушки
k = N # Начальное положение кузнечика
L_2 = 2 #шаг ляг.
L_3 = 3 #шаг ляг.
K_1 = 1 #шаг куз.
K_2 = 2 #шаг куз.

RL = 1 # Постоянное положение лягушки
RK = k # Постоянное положение кузнечика

count = 0
if N >= 4:
    while RL != RK:
        count += 1
        if RL + L_3 > RK - K_2:
            if RL + L_2 > RK - K_2:
                break
            else:
                RL += L_2
                RK -= K_2
        else:
            RL += L_3
            RK -= K_2
print(count)






